//PAYJOB01 JOB (ACCT01),'PAYROLL RUN',CLASS=A,MSGCLASS=X,               00000010
//             NOTIFY=&SYSUID                                           00000020
//*-------------------------------------------------------------
//* SYNTHETIC FIXTURE: PAYROLL NIGHTLY RUN, EXEC PGM=COMMENTED
//*-------------------------------------------------------------
//JOBLIB   DD DSN=PAY.LOADLIB,DISP=SHR
//         JCLLIB ORDER=(SYS1.PROCLIB,PAY.PROCLIB)
//         SET HLQ=PAY
//SORTPROC PROC
//SORT     EXEC PGM=SORT
//SORTIN   DD DSN=&HLQ..INPUT,DISP=SHR
//SORTOUT  DD DSN=&&SORTED,DISP=(NEW,PASS)
//         PEND
//STEP010  EXEC PGM=PAYCALC,PARM='MODE=FULL' RUN THE CALCULATION
//STEPLIB  DD DSN=PAY.LOADLIB,DISP=SHR
//MASTER   DD DSN=PAY.MASTER.FILE,DISP=OLD
//REPORT   DD DSN=PAY.REPORT(+1),DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(10,5)),UNIT=SYSDA
//SYSIN    DD *
  CALLNAT 'NOTREAL'
  SORT FIELDS=(1,10,CH,A)
/*
//STEP020  EXEC SORTPROC
//STEP030  EXEC PROC=PAYPROC
//STEP040  EXEC NATBATCH,
//             ZPARM='MADIO=0,STACK=(LOGON PAYLIB;PAYMAIN)'
//CMSYNIN  DD DATA,DLM=$$
//STEP099  EXEC PGM=IGNORED
$$
//STEP050  EXEC PGM=&PGMNAME
//         INCLUDE MEMBER=PAYDDS
//STEP060  EXEC PGM=IEFBR14
//OLDFILE  DD DSN=PAY.OLD.FILE,DISP=(MOD,DELETE)
//DUMMYDD  DD DUMMY
//SYSOUT   DD SYSOUT=*
//OUT2     DD DSN=*.STEP010.MASTER,DISP=SHR
//
