* >Natural Source Header 000000
* :Mode S
** Program CUSTUPD - update customer balances (synthetic fixture)
DEFINE DATA
LOCAL USING CUSTLDA
PARAMETER USING CUSTPDA
LOCAL
1 CUST VIEW OF CUSTOMER-FILE
  2 CUST-ID (N8)
  2 BALANCE (P9.2)
1 ORD VIEW ORDER-FILE
  2 ORDER-ID (N10)
1 #PGM (A8) INIT <'DYNPGM'>
1 #MSG (A60)
END-DEFINE
R1. READ CUST BY CUST-ID
  PERFORM CHECK-BALANCE
  UPDATE (R1.)
END-READ
FIND ORD WITH ORDER-ID = 1
  DELETE
END-FIND
STORE CUST
GET ORD 4711
HISTOGRAM CUST CUST-ID
END-HISTOGRAM
CALLNAT 'CUSTVAL' CUST-ID #MSG /* validate customer
FETCH RETURN 'CUSTMENU'
CALLNAT #PGM
CALL 'CEEDATE' #MSG
INCLUDE CUSTCC1
PERFORM WRITE-LOG
WRITE 'CALLNAT NOTREAL' /* the constant only mentions a call
*
DEFINE SUBROUTINE CHECK-BALANCE
  IF BALANCE < 0
    CALLNAT 'CUSTWARN' CUST-ID
  END-IF
END-SUBROUTINE
END
CALLNAT 'AFTEREND'
